# Define Environment

In [1]:
ENV = 'development'

# Initiate ETL

In [2]:
import tensorflow as tf
import numpy as np
import csv
import os
import pandas as pd
from pandas import DataFrame as DF
import yaml
import psycopg2
import sys
import json
import mysql.connector

/home/adrianekas/.local/lib/python2.7/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

# 1. Objective: Infer how TIPE_PERUSAHAAN, PENDIDIKAN_TERAKHIR, and LOKASI, TIPE_INDUSTRI, KATEGORI_PEKERJAAN, JENJANG_KARIR, PENGALAMAN_KERJA, SALARY affects salary using a linear model

In [3]:
DIR = os.getcwd()
PATH_QUERY = DIR + '/sql_query/'

QUERY_USER = ""
QUERY_OPPORTUNITIES = ""
TIPE_PERUSAHAAN = []
PENDIDIKAN_TERAKHIR = []
LOKASI = []
TIPE_INDUSTRI = []
KATEGORI_PEKERJAAN = []
JENJANG_KARIR = []
PENGALAMAN_KERJA = []
SALARY = []
GSOURCE = []

# Prepare Connection

In [4]:
CONFIG_PATH = DIR + '/config/'

KARIR_DATABASE = CONFIG_PATH + 'karir.database.yaml'
with open(KARIR_DATABASE, 'r') as stream:
    try:
        CONFIG = yaml.load(stream)
        KARIR_CONFIG_ENV = CONFIG[ENV]
    except yaml.YAMLError as exc:
        print(exc)
        
ML_DATABASE = CONFIG_PATH + 'ml.database.yaml'
with open(ML_DATABASE, 'r') as stream:
    try:
        CONFIG = yaml.load(stream)
        ML_CONFIG_ENV = CONFIG[ENV]
    except yaml.YAMLError as exc:
        print(exc)

# Prepare Query

In [5]:
def getQuery (textFile):
    query = ""
    with open(PATH_QUERY + textFile) as f: 
        for line in f: 
            query += line
    query.replace('\n', ' ').replace('\r', '').replace('\xef', '').replace('\xbb', '').replace('\xbf', '')
    return query

In [6]:
QUERY_USER = getQuery("extract data")
QUERY_OPPORTUNITIES = getQuery("extract data - opportunities")

# Collect Data

In [7]:
def collectData(QUERY):
    try:
        con = psycopg2.connect(database=KARIR_CONFIG_ENV['database'],
                               user=KARIR_CONFIG_ENV['username'], 
                               password=KARIR_CONFIG_ENV['password'],
                               port=KARIR_CONFIG_ENV['port'],
                               host=KARIR_CONFIG_ENV['host'])
        cur = con.cursor()

        cur.execute(QUERY)

        for row in cur:
            TIPE_PERUSAHAAN.append(row[0])
            PENDIDIKAN_TERAKHIR.append(row[1])
            LOKASI.append(row[2])
            TIPE_INDUSTRI.append(row[3])
            KATEGORI_PEKERJAAN.append(row[4])
            JENJANG_KARIR.append(row[5])
            PENGALAMAN_KERJA.append(row[6])
            SALARY.append(row[7])
            GSOURCE.append(row[8])

        cur.close()
        print("done")
    except psycopg2.DatabaseError, e:
        print 'Error %s' % e
        sys.exit(1)
    finally:
        if con:
            con.close()

In [8]:
collectData(QUERY_USER)
collectData(QUERY_OPPORTUNITIES)

done
done

# 3. Data Cleaning

In [9]:
# make sure all data valid
cols = ['TIPE_PERUSAHAAN','PENDIDIKAN_TERKAHIR','LOKASI',
        'TIPE_PERUSAHAAN','KATEGORI_PEKERJAAN','JENJANG_KARIR',
        'PENGALAMAN_KERJA']
df = DF(list(zip(TIPE_PERUSAHAAN,PENDIDIKAN_TERAKHIR,LOKASI,
                 TIPE_INDUSTRI,KATEGORI_PEKERJAAN,JENJANG_KARIR,
                 PENGALAMAN_KERJA)),columns=cols)
df['SALARY'] = SALARY
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12047 entries, 0 to 12046
Data columns (total 8 columns):
TIPE_PERUSAHAAN        12047 non-null object
PENDIDIKAN_TERKAHIR    12047 non-null object
LOKASI                 12047 non-null object
TIPE_PERUSAHAAN        12047 non-null object
KATEGORI_PEKERJAAN     12047 non-null object
JENJANG_KARIR          12047 non-null object
PENGALAMAN_KERJA       12047 non-null float64
SALARY                 12047 non-null int64
dtypes: float64(1), int64(1), object(6)
memory usage: 753.0+ KB

In [10]:
df.describe()

       PENGALAMAN_KERJA        SALARY
count      12047.000000  1.204700e+04
mean           1.685241  4.824840e+06
std            1.896135  8.608743e+06
min            0.000000  0.000000e+00
25%            0.000000  2.500000e+06
50%            1.000000  2.500000e+06
75%            2.000000  3.500000e+06
max           24.000000  1.250000e+08

In [11]:
df = df[df.SALARY >= 1000000 ]
df.describe()

       PENGALAMAN_KERJA        SALARY
count      11982.000000  1.198200e+04
mean           1.687832  4.850164e+06
std            1.897051  8.625157e+06
min            0.000000  1.000000e+06
25%            0.000000  2.500000e+06
50%            1.000000  2.500000e+06
75%            2.000000  3.637500e+06
max           24.000000  1.250000e+08

In [12]:
df.describe(include=['object'])
df.head()

,TIPE_PERUSAHAAN,PENDIDIKAN_TERKAHIR,LOKASI,TIPE_PERUSAHAAN,KATEGORI_PEKERJAAN,JENJANG_KARIR,PENGALAMAN_KERJA,SALARY
0,Lokal/Nasional,associate,Tangerang,Keuangan / Bank,Operasional,supervisor,3.500000,6000000
1,Lokal/Nasional,associate,DKI-Jakarta,Perdagangan Umum,Manajemen,assistant manager,1.665525,16000000
2,Lokal/Nasional,associate,DKI-Jakarta,Properti,Teknik,entry level staff,0.832192,5000000
3,Lokal/Nasional,associate,Tangerang,Manufaktur,Management Trainee,entry level staff,0.250000,4250000
4,Multinasional,associate,Jakarta Selatan,Keuangan / Bank,Konsultan,entry level staff,0.183105,4250000

# 4. Export Data to ML DB

In [13]:
print ML_CONFIG_ENV

{'username': 'root', 'host': 'localhost', 'password': 'jacksparrow1', 'port': 3306, 'database': 'QML'}

In [14]:
mydb = mysql.connector.connect(
  host=ML_CONFIG_ENV['host'],
  port=ML_CONFIG_ENV['port'],
  user=ML_CONFIG_ENV['username'],
  passwd=ML_CONFIG_ENV['password'],
  database=ML_CONFIG_ENV['database']
)

mycursor = mydb.cursor()

In [15]:
row_count = df.shape[0] 
print row_count

11982

In [ ]:
sql = ("INSERT INTO Salary_RawData (tipe_perusahaan, pendidikan_terakhir," +
       "lokasi, tipe_industri, kategori_pekerjaan, jenjang_karir," +
       "pengalaman_kerja, salary , gsource) VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s)")
for i in range (0,row_count):
    val = (df.iloc[i][0],df.iloc[i][1],df.iloc[i][2],df.iloc[i][3],
           df.iloc[i][4],df.iloc[i][5],df.iloc[i][6],df.iloc[i][7],GSOURCE[i])
    mycursor.execute(sql, val)
    mydb.commit()